In [2]:
import pandas as pd
import numpy as np

In [9]:
s = pd.Series()
s

C:\Jayaprakash\DataScience\Projects\TestProject\env\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

Series([], dtype: float64)

In [17]:
## Data  created using numpy array
data = np.array(['1',111])
s = pd.Series(data, index=['a','b'])
s

a      1
b    111
dtype: object

In [19]:
## Data  created using list
s = pd.Series(['da','ta'], index=['a','b'])
s

a    da
b    ta
dtype: object

In [26]:
##Create a Series from dict

data = {'a':0,'b': 'jayaprakash'}
s= pd.Series(data, index=['b','a'])
s

b    jayaprakash
a              0
dtype: object

In [42]:
s = pd.Series([111,211,113,411,511],index = ['a','b','c','d','e'])
s[:],s[0],s[:3],s[2:],s[-1],s[-4:-2]

(a    111
 b    211
 c    113
 d    411
 e    511
 dtype: int64,
 111,
 a    111
 b    211
 c    113
 dtype: int64,
 c    113
 d    411
 e    511
 dtype: int64,
 511,
 b    211
 c    113
 dtype: int64)

In [41]:
 s[-5:-2]

a    111
b    211
c    113
dtype: int64

In [55]:
data = pd.DataFrame([[1,2],[3,4]], columns=['A1','A2'], index= [111,222])
data

     A1  A2
111   1   2
222   3   4

In [77]:
d = {
    'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd']), 
   'three' : pd.Series([10,20,30], index=['a','b','c'])
    }

df = pd.DataFrame(d)
print ("Our dataframe is:")
df

Our dataframe is:

   one  two  three
a  1.0    1   10.0
b  2.0    2   20.0
c  3.0    3   30.0
d  NaN    4    NaN

In [78]:
type(df)

pandas.core.frame.DataFrame

In [79]:
df.drop(["three"], axis=1)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [80]:
df.drop(columns=["one","two"])

   three
a   10.0
b   20.0
c   30.0
d    NaN

In [122]:
df1 = pd.DataFrame([[100,200],[300,400]] , columns=['a','b'], index=[1,2])
df2 = pd.DataFrame([[500,600],[700,800]] , columns=['a','b'], index=[3,4])

df = df1.append(df2)
df

     a    b
1  100  200
2  300  400
3  500  600
4  700  800

In [123]:
df.drop(3)

     a    b
1  100  200
2  300  400
4  700  800

# Series Basic Functionality

In [150]:
ds = pd.Series(np.random.randn(4))
ds, ds.axes, ds.empty, ds.ndim, ds.size, ds.values,ds.dtype

(0   -0.378990
 1    0.330589
 2    0.140300
 3    1.138485
 dtype: float64,
 [RangeIndex(start=0, stop=4, step=1)],
 False,
 1,
 4,
 array([-0.37898977,  0.33058911,  0.14029961,  1.13848533]),
 dtype('float64'))

In [148]:
ds.head(2), ds.tail(3),

(0   -1.400832
 1    0.393663
 dtype: float64,
 1    0.393663
 2   -0.507372
 3   -0.806987
 dtype: float64,
 dtype('float64'))

# DataFrame Basic Functionality

In [173]:
data ={'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack']),
   'Age':pd.Series([25,26,25,23,30,29,23]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8])}

df1 = pd.DataFrame(data)
df1

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [193]:
df1.dtypes, df1.ndim, df1.empty, df1.axes, df1.shape, df1.size, df1.values

(Name       object
 Age         int64
 Rating    float64
 dtype: object,
 2,
 False,
 [RangeIndex(start=0, stop=7, step=1),
  Index(['Name', 'Age', 'Rating'], dtype='object')],
 (7, 3),
 21,
 array([['Tom', 25, 4.23],
        ['James', 26, 3.24],
        ['Ricky', 25, 3.98],
        ['Vin', 23, 2.56],
        ['Steve', 30, 3.2],
        ['Smith', 29, 4.6],
        ['Jack', 23, 3.8]], dtype=object))

In [180]:
df1.T,df1.T.shape

(           0      1      2     3      4      5     6
 Name     Tom  James  Ricky   Vin  Steve  Smith  Jack
 Age       25     26     25    23     30     29    23
 Rating  4.23   3.24   3.98  2.56    3.2    4.6   3.8,
 (3, 7))

In [166]:
df2 = pd.DataFrame(np.random.random(size=(3,5)))
df2.shape, df2, df2.axes, df2.dtypes

((3, 5),
           0         1         2         3         4
 0  0.443656  0.260831  0.478525  0.769312  0.878852
 1  0.740570  0.235304  0.558007  0.476241  0.425851
 2  0.457120  0.645795  0.501326  0.179635  0.674973,
 [RangeIndex(start=0, stop=3, step=1), RangeIndex(start=0, stop=5, step=1)],
 0    float64
 1    float64
 2    float64
 3    float64
 4    float64
 dtype: object)

In [171]:
df2.head(2), df.tail(1), df.ndim, df.empty

(          0         1         2         3         4
 0  0.443656  0.260831  0.478525  0.769312  0.878852
 1  0.740570  0.235304  0.558007  0.476241  0.425851,
         0         1         2         3         4
 2  0.1572  0.749402  0.901528  0.084165  0.728988,
 2,
 False)

In [169]:
type(df2.values)

numpy.ndarray

In [162]:
df2.cumsum(axis=0), df2.cumsum(axis=1)

(          0         1         2         3         4
 0  0.128768  0.910345  0.687463  0.732910  0.924980
 1  0.631422  1.783929  1.679399  0.974468  1.728846
 2  1.628470  1.787513  2.595547  1.873437  1.775478,
           0         1         2         3         4
 0  0.128768  1.039113  1.726575  2.459485  3.384466
 1  0.502654  1.376238  2.368174  2.609732  3.413597
 2  0.997048  1.000632  1.916781  2.815750  2.862383)

In [191]:
df1.loc[0:3], df1.iloc[0:3]

(    Name  Age  Rating
 0    Tom   25    4.23
 1  James   26    3.24
 2  Ricky   25    3.98
 3    Vin   23    2.56,
     Name  Age  Rating
 0    Tom   25    4.23
 1  James   26    3.24
 2  Ricky   25    3.98)

In [203]:
df1

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
3    Vin   23    2.56
4  Steve   30    3.20
5  Smith   29    4.60
6   Jack   23    3.80

In [201]:
df1.iloc[:3,[0,2]]

    Name  Rating
0    Tom    4.23
1  James    3.24
2  Ricky    3.98

In [207]:
df1[df1['Age']>23]

    Name  Age  Rating
0    Tom   25    4.23
1  James   26    3.24
2  Ricky   25    3.98
4  Steve   30    3.20
5  Smith   29    4.60

In [211]:
data = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

df = pd.DataFrame(data)
df

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [217]:
 df.mean(), df.median(), df.mode()

(Age       31.833333
 Rating     3.743333
 dtype: float64,
 Age       29.50
 Rating     3.79
 dtype: float64,
       Name   Age  Rating
 0   Andres  23.0    2.56
 1   Betina  25.0    2.98
 2    David  30.0    3.20
 3   Gasper   NaN    3.24
 4     Jack   NaN    3.65
 5    James   NaN    3.78
 6      Lee   NaN    3.80
 7    Ricky   NaN    3.98
 8    Smith   NaN    4.10
 9    Steve   NaN    4.23
 10     Tom   NaN    4.60
 11     Vin   NaN    4.80)

In [218]:
df.sum(),df.count(), df.min(), df.max()

(Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
 Age                                                     382
 Rating                                                44.92
 dtype: object,
 Name      12
 Age       12
 Rating    12
 dtype: int64,
 Name      Andres
 Age           23
 Rating      2.56
 dtype: object,
 Name      Vin
 Age        51
 Rating    4.8
 dtype: object)

In [222]:
df["Age"].abs(), df.prod()

(0     25
 1     26
 2     25
 3     23
 4     30
 5     29
 6     23
 7     34
 8     40
 9     30
 10    51
 11    46
 Name: Age, dtype: int64,
 Age       7.158408e+17
 Rating    6.320128e+06
 dtype: float64)

In [225]:
df.cumsum(), df["Age"].cumprod()

(                                                 Name  Age  Rating
 0                                                 Tom   25    4.23
 1                                            TomJames   51    7.47
 2                                       TomJamesRicky   76   11.45
 3                                    TomJamesRickyVin   99   14.01
 4                               TomJamesRickyVinSteve  129   17.21
 5                          TomJamesRickyVinSteveSmith  158   21.81
 6                      TomJamesRickyVinSteveSmithJack  181   25.61
 7                   TomJamesRickyVinSteveSmithJackLee  215   29.39
 8              TomJamesRickyVinSteveSmithJackLeeDavid  255   32.37
 9        TomJamesRickyVinSteveSmithJackLeeDavidGasper  285   37.17
 10  TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...  336   41.27
 11  TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...  382   44.92,
 0                     25
 1                    650
 2                  16250
 3                 373750
 4               11212500
 5              325162500
 6             7478737500
 7           254277075000
 8         10171083000000
 9        305132490000000
 10     15561756990000000
 11    715840821540000000
 Name: Age, dtype: int64)

In [232]:
df.info

<bound method DataFrame.info of       Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65>

In [236]:
df.describe(include='all')

          Name        Age     Rating
count       12  12.000000  12.000000
unique      12        NaN        NaN
top     Andres        NaN        NaN
freq         1        NaN        NaN
mean       NaN  31.833333   3.743333
std        NaN   9.232682   0.661628
min        NaN  23.000000   2.560000
25%        NaN  25.000000   3.230000
50%        NaN  29.500000   3.790000
75%        NaN  35.500000   4.132500
max        NaN  51.000000   4.800000

In [240]:
N = 20

df = pd.DataFrame({
   'A': pd.date_range(start='2016-01-01',periods=N,freq='D'),
   'x': np.linspace(0,stop=N-1,num=N),
   'y': np.random.rand(N),
   'C': np.random.choice(['Low','Medium','High'],N).tolist(),
   'D': np.random.normal(100, 10, size=(N)).tolist()
})
df

            A     x         y       C           D
0  2016-01-01   0.0  0.072984  Medium   89.041548
1  2016-01-02   1.0  0.995132     Low  105.007289
2  2016-01-03   2.0  0.731050    High  104.314835
3  2016-01-04   3.0  0.343972    High  106.727621
4  2016-01-05   4.0  0.383603     Low  109.324052
5  2016-01-06   5.0  0.368745     Low   92.917097
6  2016-01-07   6.0  0.255517  Medium   92.495936
7  2016-01-08   7.0  0.812660     Low   98.251429
8  2016-01-09   8.0  0.966594    High   92.634028
9  2016-01-10   9.0  0.149676    High  114.217558
10 2016-01-11  10.0  0.007926    High   89.947314
11 2016-01-12  11.0  0.801003  Medium  105.077065
12 2016-01-13  12.0  0.846771  Medium   96.187683
13 2016-01-14  13.0  0.263661     Low   82.584617
14 2016-01-15  14.0  0.649804    High   98.287841
15 2016-01-16  15.0  0.925556    High  107.152904
16 2016-01-17  16.0  0.808108    High  111.730098
17 2016-01-18  17.0  0.710535     Low  100.078899
18 2016-01-19  18.0  0.439707    High   89.040345
19 2016-01-20  19.0  0.683132     Low  105.474035

In [244]:
reindexed_df = df.reindex(index=[0,5,12], columns=['x','y'])
reindexed_df

       x         y
0    0.0  0.072984
5    5.0  0.368745
12  12.0  0.846771

In [251]:
np.random.random(), np.random.randint(10,100, size=[3,5]), np.random.randn(25)

(0.4778211212104039,
 array([[14, 69, 69, 73, 72],
        [98, 86, 72, 71, 19],
        [47, 93, 58, 43, 20]]),
 array([-0.2590898 ,  0.24992072,  0.14472218,  1.06001047,  1.19463889,
         0.39659742,  2.22438169, -0.10954185,  0.26060873, -1.40776931,
        -0.27540382, -1.37450607,  0.4222432 , -0.04254638,  0.12561115,
         0.73322275, -0.68017976,  0.0972756 , -0.79779497,  0.33937931,
         0.10313805, -0.87829812,  1.11999874, -0.84204647, -0.19093129]))

In [271]:
data = np.random.randn(15,4)
df = pd.DataFrame(data, columns = ['East','West','North','South'] , index =  pd.date_range('01/01/2020',freq='D',periods=len(data)))
df

                East      West     North     South
2020-01-01  0.631753 -0.237584 -0.200712 -0.045071
2020-01-02  0.074720 -1.235421 -0.405470 -2.792730
2020-01-03  0.610442 -1.240498 -1.700925  0.987824
2020-01-04 -0.646793  0.166877  0.249572 -1.225415
2020-01-05 -1.378078 -0.641085 -0.283106  0.782023
2020-01-06  0.610200 -0.968022  0.923348  0.268231
2020-01-07 -0.475664 -0.065375  1.533509 -0.892391
2020-01-08  0.919777  0.804525 -0.105313 -0.908111
2020-01-09 -0.281615  0.221548  2.028944  0.270588
2020-01-10  1.155294 -0.473938 -0.106490  1.669805
2020-01-11  0.842909  0.284370  0.093931  1.835755
2020-01-12 -0.093314  0.394627 -1.125616  0.277208
2020-01-13  0.164740  0.840231 -0.503115 -0.309818
2020-01-14 -0.272772 -0.232071 -0.654850 -1.391940
2020-01-15  0.160897  1.577793 -0.523758 -2.370680

In [281]:
df.sort_index()

                East     North     South      West
2020-01-01  0.631753 -0.200712 -0.045071 -0.237584
2020-01-02  0.074720 -0.405470 -2.792730 -1.235421
2020-01-03  0.610442 -1.700925  0.987824 -1.240498
2020-01-04 -0.646793  0.249572 -1.225415  0.166877
2020-01-05 -1.378078 -0.283106  0.782023 -0.641085
2020-01-06  0.610200  0.923348  0.268231 -0.968022
2020-01-07 -0.475664  1.533509 -0.892391 -0.065375
2020-01-08  0.919777 -0.105313 -0.908111  0.804525
2020-01-09 -0.281615  2.028944  0.270588  0.221548
2020-01-10  1.155294 -0.106490  1.669805 -0.473938
2020-01-11  0.842909  0.093931  1.835755  0.284370
2020-01-12 -0.093314 -1.125616  0.277208  0.394627
2020-01-13  0.164740 -0.503115 -0.309818  0.840231
2020-01-14 -0.272772 -0.654850 -1.391940 -0.232071
2020-01-15  0.160897 -0.523758 -2.370680  1.577793

In [289]:
df.sort_values( ascending=False, by =['East','North'])

                East     North     South      West
2020-01-10  1.155294 -0.106490  1.669805 -0.473938
2020-01-08  0.919777 -0.105313 -0.908111  0.804525
2020-01-11  0.842909  0.093931  1.835755  0.284370
2020-01-01  0.631753 -0.200712 -0.045071 -0.237584
2020-01-03  0.610442 -1.700925  0.987824 -1.240498
2020-01-06  0.610200  0.923348  0.268231 -0.968022
2020-01-13  0.164740 -0.503115 -0.309818  0.840231
2020-01-15  0.160897 -0.523758 -2.370680  1.577793
2020-01-02  0.074720 -0.405470 -2.792730 -1.235421
2020-01-12 -0.093314 -1.125616  0.277208  0.394627
2020-01-14 -0.272772 -0.654850 -1.391940 -0.232071
2020-01-09 -0.281615  2.028944  0.270588  0.221548
2020-01-07 -0.475664  1.533509 -0.892391 -0.065375
2020-01-04 -0.646793  0.249572 -1.225415  0.166877
2020-01-05 -1.378078 -0.283106  0.782023 -0.641085

In [310]:
str = "In this chapter, we will discuss the string operations with our basic Series/Index. In the subsequent chapters, we will learn how to apply these string functions on the DataFrame. Pandas provides a set of string functions which make it easy to operate on string data. Most importantly, these functions ignore (or exclude) missing/NaN values"
len(str) ,str.lower(), str.upper(), str.islower(), str.isupper(), str.strip(), str.isnumeric(), str.swapcase()

(340,
 'in this chapter, we will discuss the string operations with our basic series/index. in the subsequent chapters, we will learn how to apply these string functions on the dataframe. pandas provides a set of string functions which make it easy to operate on string data. most importantly, these functions ignore (or exclude) missing/nan values',
 'IN THIS CHAPTER, WE WILL DISCUSS THE STRING OPERATIONS WITH OUR BASIC SERIES/INDEX. IN THE SUBSEQUENT CHAPTERS, WE WILL LEARN HOW TO APPLY THESE STRING FUNCTIONS ON THE DATAFRAME. PANDAS PROVIDES A SET OF STRING FUNCTIONS WHICH MAKE IT EASY TO OPERATE ON STRING DATA. MOST IMPORTANTLY, THESE FUNCTIONS IGNORE (OR EXCLUDE) MISSING/NAN VALUES',
 False,
 False,
 'In this chapter, we will discuss the string operations with our basic Series/Index. In the subsequent chapters, we will learn how to apply these string functions on the DataFrame. Pandas provides a set of string functions which make it easy to operate on string data. Most importantly, these functions ignore (or exclude) missing/NaN values',
 False,
 'iN THIS CHAPTER, WE WILL DISCUSS THE STRING OPERATIONS WITH OUR BASIC sERIES/iNDEX. iN THE SUBSEQUENT CHAPTERS, WE WILL LEARN HOW TO APPLY THESE STRING FUNCTIONS ON THE dATAfRAME. pANDAS PROVIDES A SET OF STRING FUNCTIONS WHICH MAKE IT EASY TO OPERATE ON STRING DATA. mOST IMPORTANTLY, THESE FUNCTIONS IGNORE (OR EXCLUDE) MISSING/nAn VALUES')

In [ ]:
## Group by

In [324]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [334]:
teams_df = df.groupby("Team").groups
teams_df

{'Devils': Int64Index([2, 3], dtype='int64'),
 'Kings': Int64Index([4, 6, 7], dtype='int64'),
 'Riders': Int64Index([0, 1, 8, 11], dtype='int64'),
 'Royals': Int64Index([9, 10], dtype='int64'),
 'kings': Int64Index([5], dtype='int64')}

In [338]:
teams_df = df.groupby("Team")
teams_df.get_group("Kings")

    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788

In [351]:
grouped = df.groupby(["Team"])

grouped['Points'].agg(np.mean)

Team
Devils    768.000000
Kings     761.666667
Riders    762.250000
Royals    752.500000
kings     812.000000
Name: Points, dtype: float64

In [352]:
grouped = df.groupby(["Team"])

grouped.agg(np.size)

        Rank  Year  Points
Team
Devils     2     2       2
Kings      3     3       3
Riders     4     4       4
Royals     2     2       2
kings      1     1       1

In [358]:
grouped['Points'].agg([np.mean, np.min, np.max,np.std])

              mean  amin  amax         std
Team
Devils  768.000000   673   863  134.350288
Kings   761.666667   741   788   24.006943
Riders  762.250000   690   876   88.567771
Royals  752.500000   701   804   72.831998
kings   812.000000   812   812         NaN

# Joining / Merging

In [359]:
left = pd.DataFrame({
   'id':[1,2,3,4,5],
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame(
   {'id':[1,2,3,4,5],
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5']})

In [361]:
print(left)
print(right)

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5
   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [363]:
pd.merge(left,right,on='id')

   id  Name_x subject_id_x Name_y subject_id_y
0   1    Alex         sub1  Billy         sub2
1   2     Amy         sub2  Brian         sub4
2   3   Allen         sub4   Bran         sub3
3   4   Alice         sub6  Bryce         sub6
4   5  Ayoung         sub5  Betty         sub5

In [364]:
pd.merge(left,right,on=['id','subject_id'])
## on field name

   id  Name_x subject_id Name_y
0   4   Alice       sub6  Bryce
1   5  Ayoung       sub5  Betty

In [373]:
pd.merge(left,right,on=['subject_id'],how='left')
##how : left, right, outer, innter

   id_x  Name_x subject_id  id_y Name_y
0     1    Alex       sub1   NaN    NaN
1     2     Amy       sub2   1.0  Billy
2     3   Allen       sub4   2.0  Brian
3     4   Alice       sub6   4.0  Bryce
4     5  Ayoung       sub5   5.0  Betty

# Concatenation

In [3]:
one = pd.DataFrame({
   'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
   'subject_id':['sub1','sub2','sub4','sub6','sub5'],
   'Marks_scored':[98,90,87,69,78]},
   index=[1,2,3,4,5])

two = pd.DataFrame({
   'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
   'subject_id':['sub2','sub4','sub3','sub6','sub5'],
   'Marks_scored':[89,80,79,97,88]},
   index=[1,2,3,4,5])

In [4]:
one, two

(     Name subject_id  Marks_scored
 1    Alex       sub1            98
 2     Amy       sub2            90
 3   Allen       sub4            87
 4   Alice       sub6            69
 5  Ayoung       sub5            78,
     Name subject_id  Marks_scored
 1  Billy       sub2            89
 2  Brian       sub4            80
 3   Bran       sub3            79
 4  Bryce       sub6            97
 5  Betty       sub5            88)

In [5]:
pd.concat([one,two], axis=0,ignore_index=True)

     Name subject_id  Marks_scored
0    Alex       sub1            98
1     Amy       sub2            90
2   Allen       sub4            87
3   Alice       sub6            69
4  Ayoung       sub5            78
5   Billy       sub2            89
6   Brian       sub4            80
7    Bran       sub3            79
8   Bryce       sub6            97
9   Betty       sub5            88

In [6]:
pd.concat([one,two,one], axis=0,ignore_index=True)

      Name subject_id  Marks_scored
0     Alex       sub1            98
1      Amy       sub2            90
2    Allen       sub4            87
3    Alice       sub6            69
4   Ayoung       sub5            78
5    Billy       sub2            89
6    Brian       sub4            80
7     Bran       sub3            79
8    Bryce       sub6            97
9    Betty       sub5            88
10    Alex       sub1            98
11     Amy       sub2            90
12   Allen       sub4            87
13   Alice       sub6            69
14  Ayoung       sub5            78

In [9]:
one.append(two,ignore_index=True, sort = True)

   Marks_scored    Name subject_id
0            98    Alex       sub1
1            90     Amy       sub2
2            87   Allen       sub4
3            69   Alice       sub6
4            78  Ayoung       sub5
5            89   Billy       sub2
6            80   Brian       sub4
7            79    Bran       sub3
8            97   Bryce       sub6
9            88   Betty       sub5

# Time Series

In [33]:
pd.datetime.now(), pd.datetime.today()
print(pd.datetime.today())

2020-02-28 12:50:44.866102

C:\Jayaprakash\DataScience\Projects\TestProject\env\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  """Entry point for launching an IPython kernel.
C:\Jayaprakash\DataScience\Projects\TestProject\env\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.

In [11]:
import datetime as dt

In [23]:
dt.datetime(year=2020,month=2, day=6), dt.today

AttributeError: module 'datetime' has no attribute 'today'

In [51]:
pd.Timestamp(729,unit='D'), pd.Timestamp(729,unit='s'), pd.Timestamp(22,unit='m')

(Timestamp('1971-12-31 00:00:00'),
 Timestamp('1970-01-01 00:12:09'),
 Timestamp('1970-01-01 00:22:00'))

In [62]:
pd.date_range('01/01/2020','31/12/2020', periods=12, ), len(pd.date_range('01/01/2020','31/12/2020', freq='24H'))

(DatetimeIndex([          '2020-01-01 00:00:00',
                '2020-02-03 04:21:49.090909091',
                '2020-03-07 08:43:38.181818182',
                '2020-04-09 13:05:27.272727273',
                '2020-05-12 17:27:16.363636364',
                '2020-06-14 21:49:05.454545456',
                '2020-07-18 02:10:54.545454546',
                '2020-08-20 06:32:43.636363636',
                '2020-09-22 10:54:32.727272728',
                '2020-10-25 15:16:21.818181820',
                '2020-11-27 19:38:10.909090912',
                          '2020-12-31 00:00:00'],
               dtype='datetime64[ns]', freq=None),
 366)

# Missing Data

In [124]:
df = pd.DataFrame(np.random.randn(10,4), columns=['North','East','West','South'] , index=['b','d','e','f','h','i','j','k','l','m'])
df1 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [125]:
df,df1, df1.isnull()

(      North      East      West     South
 b -0.588660  0.044894  1.610460 -0.778906
 d  0.593085 -0.059623  0.937582  0.358375
 e -0.650774 -1.145826 -0.710031 -0.911166
 f  0.460729  0.169214 -0.773947 -1.560552
 h -0.304007 -0.066561  0.619579  0.244775
 i  0.984516 -2.077825  0.309922  1.637351
 j  1.529047 -0.378083  1.167526 -0.071071
 k -0.627246  0.099190 -0.412204  0.448348
 l -0.593056  1.308422  0.098778  2.800652
 m -1.379168 -0.894283 -1.265868  0.975396,
       North      East      West     South
 a       NaN       NaN       NaN       NaN
 b -0.588660  0.044894  1.610460 -0.778906
 c       NaN       NaN       NaN       NaN
 d  0.593085 -0.059623  0.937582  0.358375
 e -0.650774 -1.145826 -0.710031 -0.911166
 f  0.460729  0.169214 -0.773947 -1.560552
 g       NaN       NaN       NaN       NaN
 h -0.304007 -0.066561  0.619579  0.244775,
    North   East   West  South
 a   True   True   True   True
 b  False  False  False  False
 c   True   True   True   True
 d  False  False  False  False
 e  False  False  False  False
 f  False  False  False  False
 g   True   True   True   True
 h  False  False  False  False)

In [126]:
df1

      North      East      West     South
a       NaN       NaN       NaN       NaN
b -0.588660  0.044894  1.610460 -0.778906
c       NaN       NaN       NaN       NaN
d  0.593085 -0.059623  0.937582  0.358375
e -0.650774 -1.145826 -0.710031 -0.911166
f  0.460729  0.169214 -0.773947 -1.560552
g       NaN       NaN       NaN       NaN
h -0.304007 -0.066561  0.619579  0.244775

In [116]:
df1['North'] = df1['North'].fillna(df1['North'].min())

In [118]:
df1['South'] = df1['South'].fillna(222)

In [120]:
df1['West'] = df1['West'].fillna(df1['West'].max())

In [122]:
df1['East'] = df1['East'].fillna(df1['East'].mean())

In [127]:
df1

      North      East      West     South
a       NaN       NaN       NaN       NaN
b -0.588660  0.044894  1.610460 -0.778906
c       NaN       NaN       NaN       NaN
d  0.593085 -0.059623  0.937582  0.358375
e -0.650774 -1.145826 -0.710031 -0.911166
f  0.460729  0.169214 -0.773947 -1.560552
g       NaN       NaN       NaN       NaN
h -0.304007 -0.066561  0.619579  0.244775

In [132]:
df1['East'] = df1['East'].fillna(method='pad')

In [133]:
df1['West'] = df1['West'].fillna(method='backfill')

In [134]:
df1['South'] = df1['South'].fillna(method='bfill')

In [136]:
df1

      North      East      West     South
a       NaN       NaN  1.610460 -0.778906
b -0.588660  0.044894  1.610460 -0.778906
c       NaN  0.044894  0.937582  0.358375
d  0.593085 -0.059623  0.937582  0.358375
e -0.650774 -1.145826 -0.710031 -0.911166
f  0.460729  0.169214 -0.773947 -1.560552
g       NaN  0.169214  0.619579  0.244775
h -0.304007 -0.066561  0.619579  0.244775

In [137]:
df1.dropna()

      North      East      West     South
b -0.588660  0.044894  1.610460 -0.778906
d  0.593085 -0.059623  0.937582  0.358375
e -0.650774 -1.145826 -0.710031 -0.911166
f  0.460729  0.169214 -0.773947 -1.560552
h -0.304007 -0.066561  0.619579  0.244775